In [237]:
import pandas as pd
import numpy as np

In [238]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [239]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Problem 1

In [240]:
str_fnum=df['FlightNumber'].astype(str)
arr_fnum = [i for i in str_fnum]

In [241]:
for i in range(0,len(arr_fnum)):
    if arr_fnum[i]=="nan":
        arr_fnum[i]=10
    else:
        num = arr_fnum[i]
        arr_fnum[i] = float(num)+10
arr_fnum

[10055.0, 10, 10075.0, 10, 10095.0]

In [242]:
df['FlightNumber'] = arr_fnum
df['FlightNumber']= df['FlightNumber'].astype(int)

In [243]:
df.dtypes

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

In [244]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10055      [23, 47]               KLM(!)
1      MAdrid_miLAN            10            []    <Air France> (12)
2  londON_StockhOlm         10075  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis            10          [13]       12. Air France
4   Brussels_londOn         10095      [67, 32]          "Swiss Air"

# Problem 2

In [245]:
frm_to = list(df['From_To'])

In [246]:
temp_df = pd.DataFrame(frm_to,columns=['From'])
arr = [i  for i in temp_df['From']]
tit = []
frm = []
to = []
splt =[]
for i in arr:
    tit.append(i.title())
for i in tit:
    splt.append(i.split(sep='_'))
for i in range(0,len(splt)):
    frm.append(splt[i][0])
    to.append(splt[i][1])

In [247]:
temp_df['From'] = frm
temp_df['To'] = to
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# Problem 5

In [248]:
delay = list(df['RecentDelays'])

In [249]:
keys = ['Delay_1','Delay_2','Delay_3']
delay_1=[]
delay_2=[]
delay_3=[]
for i in range(0,5):
        if len(delay[i])!=3:
           if len(delay[i]) == 2:
            delay[i].append(np.NaN)
           if len(delay[i]) == 0:
            for j in range(0,3):
                delay[i].append(np.NaN)
           if len(delay[i]) == 1:
            for j in range(0,2):
                delay[i].append(np.NaN)

In [250]:
for i in range(0,5):
    for j in range(0,3):
        if j==0:
            delay_1.append(delay[i][j])
            
        elif j==1:
            delay_2.append(delay[i][j])
            
        elif j==2:
            delay_3.append(delay[i][j])  
delay_values = [delay_1,delay_2,delay_3]

In [251]:
df.drop(['From_To'],axis=1,inplace=True)
df.drop(['RecentDelays'],axis=1,inplace=True)

In [252]:
Delay_dict = {key:value for (key,value) in zip(keys,delay_values)}

In [253]:
delay_df = pd.DataFrame(Delay_dict)

In [254]:
temp_df = temp_df.join(delay_df)

In [255]:
df = df.join(temp_df)

In [256]:
df

,FlightNumber,Airline,From,To,Delay_1,Delay_2,Delay_3
0,10055,KLM(!),London,Paris,23.0,47.0,NaN
1,10,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10075,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10095,"""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [257]:
df.isnull()

   FlightNumber  Airline   From     To  Delay_1  Delay_2  Delay_3
0         False    False  False  False    False    False     True
1         False    False  False  False     True     True     True
2         False    False  False  False    False    False    False
3         False    False  False  False    False     True     True
4         False    False  False  False    False    False     True